/*
Задача 1. На вход программе через стандартный ввод передаются два целых числа,
по модулю не превышающие 100000. Выведите в стандартный вывод их сумму.
*/

#include <iostream>
using namespace std;

int z1() {
    int x1, x2;
    cin >> x1 >> x2;
    cout << x1 + x2;

    return 0;
}

int z2();
int z3();
int z4();
int z5();
int z6();
int z7();
int z8();
int z9();

int main()
{
	z1();
	z2();
	z3();
	z4();
	z5();
	z6();
	z7();
	z8();
	z9();

	return 0;
}