/*
Задача 1. На вход программе через стандартный ввод передаются два целых числа,
по модулю не превышающие 100000. Выведите в стандартный вывод их сумму.
*/

#include <iostream>


int z2();
int z3();
int z4();
int z5();
int z6();
int z7();
int z8();
int z9();

int main()
{
    std::cout << "Hello World!\n";
    z9();
}